# IsAnalyzeAsValid Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModel..::..IsAnalyzeAsValid Method
AnalyticalModel Class See Also
---
Determines if the given Analyze As parameter is valid for this Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool IsAnalyzeAsValid(
	AnalyzeAs analyzeAs
)
```

Visual Basic
---
```text
Public Function IsAnalyzeAsValid ( _
	analyzeAs As AnalyzeAs _
) As Boolean
```

Visual C++
---
```text
public:
bool IsAnalyzeAsValid(
	AnalyzeAs analyzeAs
)
```

# ### Parameters
analyzeAs
    Type: Autodesk.Revit.DB.Structure..::..AnalyzeAs Indicates how Analytical Model is analyzed.
# ### Return Value
True if valid; false otherwise.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace